package by.htp.less01.main;

public class Exercise_3 {
	public static void main(String [] args) {
		char a = 1;
		int len = a.length();
		
		System.out.println(len);
	}

}

//Дана величина А, выражающая объем информации в байтах.
//Перевести А в более крупные единицы измерения информации