package by.htp.less01.main;

public class Exercise10 {
	public static void main(String [] args) {
		int x = 2;
		
		while(x <= 100) {
			System.out.println(x);
			x = x + 2;
		}
	}

}
//С помощью оператора while напишите программу вывода всех четных чисел в диапазоне от 2 до 100 включительно.