package by.htp.less01.main;

public class Exercise_13 {
	public static void main(String [] args) {
		int a = 10;
		int y = 0;
		
		for(int x = 0; x <= a; x++) {
			y = y+x;
		}
		System.out.print(y);
	}

}
//Напишите программу, где пользователь вводит любое целое положительное число.
//А программа суммирует все числа от 1 до введенного пользователем числа.